翻译自：[https://evrone.com/yukihiro-matsumoto-interview](https://evrone.com/yukihiro-matsumoto-interview)


松本行弘：「Ruby 是为了人类设计，而不是机器」

### 介绍

非常兴奋，我们的好朋友，Ruby 语言之父，Yukihiro Matsumoto 能作为演讲者来参加我们的 RubyRussia 2019。这是他第二次来参加这个活动，上一次也是作为演讲者，参加了三年前的 RubyRussia 2016。

这个活动已经超过了十年了，Ruby 在这期间持续进化，Evrone 一直与之相伴。

Grigory Petrov，就职于 Evrone 的开发者关系部门。下面是他与 Matsumoto 先生面对面交流。内容包括聆听松本先生关于作为技术明星的感受，探讨Ruby 的设计哲学与发展；以及一些有关日本的生活与哲学。

### 预览

Grigory：这是你第二次来俄罗斯，第一次是在2016年，与那年相比，参加 RubyRussia 的人数翻了倍。谢谢您的演讲，它为我解答了想请教您的几个问题的答案，我很喜欢它。

开发者当然喜欢 Ruby，以及您为社区做的工作。我看到人们不止是向您提问，还请求和您合影，甚至向您索要签名 --- 您是一个明星。是世界各地的开发者都这样么？还是俄罗斯的开发者是特殊的？

Yukihiro：不管在哪里，都有人找我合影：任何国家与任何会议，都有人请求与我合影。但是我第一次遇到有人像我索要签名的。

Grigory：作为一门语言的创造者，应该会收到许多询问，建议，想法和其他种种。您收到最多的询问是什么？

Yukihiro：最多遇到的询问是：「我来自于语言 X 的社区；您可以在 Ruby 中加入语言 X 的特性么？」诸如此类的问题。我通常的回答是……「不可以，我不能加入那个特性」，因为我们有不同的语言设计方向与开发策略。

这个问题被许多人问过，但他们很少得到积极的回应。我们不能把语言 X 的特性硬塞进进 Ruby，虽说我们也会借鉴其他语言的特性，比如 Python，JavaScript 以及 Elixir。

Grigory：很高兴您能说「不」；我发现「由社区设计」主导工具，往往并不能得到最佳的结果。有许多不同的语言和技术，我们可以在其中找到适合的最佳实践。

给动态类型的语言添加注释，是最近的一波潮流，比如 JavaScript、Python 以及 PHP。您如何看待类型注释和渐进类型？为什么它会流行？您对在 Ruby 3 中添加类似的特性有想法么？

Yukihiro：拿 Go、Rust 这种静态语言举个例子。如果使用他们构建一个软件，并快速增长，你最终会维护一个巨大的代码库，数百万行代码，数百名团队成员一起工作；在这种场景下，类型检查是非常实用的，它可以很方便的检查出错误。

相比之下，动态类型语言，我们必须为代码编写测试以避免类型错误。软件代码的规模与测试代码的规模一起增长（这是一种负担），这确实推动了最近静态类型与渐进式类型的流行。

与此同时，静态类型定义是冗余的，在 Ruby 中，我们想从静态类型检查中获益，但是也想避免冗余的类型定义。

对 Ruby 社区和 Ruby 语言来说，我们尝试同时满足他们：我们从 Ruby 代码中分离出包含类型信息的文件，而 Ruby 代码文件中不用包含任何类型信息。我们称分离出来的类型信息文件为「Ruby 签名文件」，有关 Library、Gem 以及你的程序的类型定义信息，都将包含其中。

我们将提供一个工具，叫做「type profiler」，用来生成你的程序中的类型信息。当前程序及库的类型信息生成完毕后，type profiler 就有了所有需要的类及函数的信息。它也就可以进行类型识别，探测到类型冲突。你甚至可以改进你的签名文件以让类型识别工作的更好。

在未来，Ruby 将会提供一定程度的上的静态类型检查，但很有限。就像传统 Ruby 的行为，将会在运行时检查。通过这个「level one type checker」，将可以找出源码中的 40%-80% 的类型错误 。「level two type checker」 将会通过分析代码，生成额外的类型信息。通过这些工具，未来 Ruby 无需在代码中明确声明类型，也可以提供静态类型检查的能力。

![image.png](https://upload-images.jianshu.io/upload_images/3115-ada4e394d41a9bb7.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

Grigory：在会议的讨论期间，你提到了这点，这确实是个主意。我是一名 C/C++ 开发者，所以静态类型对我而言很自然。我一直通过通过定义定义来描述我的意图，以帮助语言和工具在未来发现可能存在的错误。

您的想法为创建一个系统，在其中编写代码，系统本身可以从你的代码中推倒出足够的信息去识别错误，而不依赖明确的类型。我非常喜欢这个想法。

进行实验以验证想法真是太好了。您对 Ruby 的未来有什么展望？您是如何把控这门语言的？

Yukihiro：事实上，我并没有把控语言或者社区。我只是提供一些技术，由社区来决定走哪条路。至少，我们在许多不同领域拥有足够的技术，以使 Ruby 更加灵活高效。举一个例子，当前 Ruby 被应用最多的就是构建 Web 应用程序，但我希望看到 Ruby 也被用于科研、AI 或者机器学习领域。我们正努力使这项技术在新的领域中更可用。

Grigory：开发们者喜欢给事物分类和贴标签。比如这是一个运动汽车，那是一个家用汽车。编程语言也一样：JavaScript 是一门「Web 语言」，C 是一个「系统级语言」，C# 用于开发「Windows 下的应用程序」。您是如何定义 Ruby 的分类的？

Yukihiro：我愿意将 Ruby 划分为「有生产力的编程语言」。生产力是 Ruby 最主要的目标。我为人类设计 Ruby，而不是机器。许多核心贡献者吐槽 Ruby 的某些设计让它难以高效的实现。Ruby 的设计把生产力放在第一次，而不是效率。这意味着实现它有更大的挑战，但我们乐于面对这种挑战：在同样的时间内，我们为开发者带来了更高的生产力，然后是尽可能的提升性能。

Grigory：对于 Python 来说，由于实现原因，我们没有多行的匿名实现调用。很高兴听到您和其他核心开发者在努力接受那些挑战，以此来让程序员的日子过的更顺心。

说到挑战，想象一下，您有一个机会，回到刚刚开始创造 Ruby 这门编程语言的时刻，面对那个年轻人，您有什么建议要给他？

Yukihiro：不要过多的借鉴其他脚本语言的特性。你的编程语言可能是最好的通用类语言。为了增加脚本语言的可比性而引入的那些特性，大多数没多大用处。因此最好不要过多的关注他们。

Grigory：过去，编译型语言和脚本语言有很多不一样的地方；现在，有了不你急、字节码以及JIT，他们之间的界限变得模糊了，世界似乎已经改变了。

在逐渐演进的过程中，您为 Ruby 实现和引入了许多实验特性，它们有些是成功的，有些不算成功。您眼中最好的 Ruby 特性是什么？

Yukihiro：如果我只能选择一个特性，我认为是 blocks。Ruby block 是非常独特，非常有用的抽象。它比其他语言中类似的机制有用的多。虽然使用有限制，但是非常方便。

Grigory：说来巧合，Block 也是我最喜欢的 Ruby 特性。在我自己的演讲和访谈中，我描述 Ruby 为 DSL、语法糖以及 Block 的集合。Blocks 很棒。

Yukihiro：在其他语言中，比如 Swift ，当方法调用的最后的一个参数是函数对象时，你可以像使用 Ruby 一样，将其围绕起大括号。类似的特性也被加进 JavaScript 中。我为此感到骄傲。

Grigory：是的，JavaScript（ES6） 中的箭头函数支持类似的语法。与之相对，在 Ruby 发展过程中，您最不喜欢哪一点？最大的设计失误是什么？它是将要被修复，还是已经被修复？

Yukihiro：真的有很多。全局变量：「脚本语言」中很有用的特性，但是现在来看它们是多余的。我们可以有更好的并发解决方案，所以添加线程支持到语言中，让我觉得懊悔。其他的设计失误，还有让一些不必要的对象可变。例如为现有的 timer 对象更改时区，其实应该创建新的对象。为此我也感到懊悔。

Grigory：是的，可变性难以驾驭，很容易在代码中引入错误。说回 Ruby，您是如何组织 Ruby 的开发工作的？您的工作日常是怎样的？

Yukihiro：我是全职 Ruby 开发者。有一半的时间我在思考未来 Ruby 3 的设计。剩下的时间花在另外一些 Ruby 实现的项目中，比如 MRuby 以及一些其他项目。

对 Ruby 而言，标准 Ruby 的实现由核心贡献者完成，我只需要做决定：「这个函数的行为应该是这样的」，「这个语言特性应该是那样的」，「这个语法像这样」，「那个语义是那样的」等等等等。我来做出判断，其他开发者去实现它们。所以，我现在一半是设计师，一半是程序员。此外我花时间最多的是在 MRuby 上。

Grigory：我查看了您的 Github 信息，看到您在俄罗斯这些天也提交了许多 commit。最近有许多关于开发者应该「释放」自己的讨论。您有空闲时间么？您有兴趣爱好么？您是如何放松自己的？

Yukihiro：幸运的是，我所有的时间都花在开源软件上。我没有让我感到压力的客户
；我没有老板；我管理我自己。这让我可以放松工作。我的 `release date` 也没有特殊的 `deadline`。我感到放松的主要原因是自由。另外，工作之外，我尝试去做与计算机和编程无关的事情。比如我会花时间遛狗和陪我的猫玩儿、我为教堂做义工、我花时间在家庭上。这些事情及花在社交上的时间，对保持一个松弛的状态也有帮助。

![image.png](https://upload-images.jianshu.io/upload_images/3115-c3286688ec907a0f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

Grigory：许多俄罗斯的 Ruby 开发者喜欢日本和日本文化。他们看漫画和动画，其中一些人还去过日本。您是一个日本人，又是一名开发者，有什么地方推荐或者有什么经验想分享给打算去日本的小伙伴？

Yukihiro：日本是一个非常多样性的国家。你可以在这儿找到像东京那种具有未来感的大都市。我们也有许多流行文化，比如漫画和动画。与此同时，也有俊美的山峰，茂密的森林和有历史感的地方，比如一些寺庙和神舍。我们也有美丽的樱花和叶子。根据你的兴趣和爱好，你可以在这里体验到不一样的东西：美食，自然，科技。我建议你体验到这个国家的多样性。

Grigory：日本的历史和文化对 Ruby 有影响么？

Yukihiro：我不太确定。在日语中，我们有句子链，一种很像  Ruby 中函数链的设定，所以可能有受到日语的一些影响。日本是一个富裕国家，一些人不用非常努力工作就可以维持生活。这允许我为开源软件工作，而不是把挣钱放在第一位。我们不用靠开源软件挣钱，通过赞助就可以维持我们的生活，这使我和其他 Ruby 贡献者可以致力于开发更好的技术。我能想到的是这些。

Grigory：最后再问一个奇怪的小问题。人们常常想知道其他人眼中的世界是怎样的，了解他们的想法和感觉。作为语言的作者，您面对外部的看法，有什么事情是别人所不了解的？

Yukihiro：不同于其他人的想象，创造一门语言技术上并非什么真的困难的任务。计算机科学专业的学生有一门作业就是实现一门语言，大部分毕业生可以编写一门他们的编程语言。严格来说，这不是什么困难的事。

事实上，人们并不了解设计语言的本质。与人类语言一样，俄语，日语，英语。语言是一种思想的支架，关乎你的思维方式。

Ruby，Python，JavaScript 以及其他编程语言，的主要目的是提供一种思考方式，允许开发者把他们的想法转化成实实在在的有用的东西。

编程语言具有不同的设计理念，设计哲学理念了开发者如何思考。Ruby 的设计理念是生产效率和使用的愉悦感。其他编程语言有不同的设计理念，简洁、性能或者其他的特性，各有不同。如果 Ruby 的设计理念让你感到舒服，它就是你的编程语言。

Grigory：谢谢您！这里是 RubyRussia 2019，Grigory Petrov 和 Yukihiro Matsumoto 的访谈，Arigato。

Yukihiro：Arigato！

视频地址：

[https://www.youtube.com/watch?v=46WjUVqagTo&feature=youtu.be](https://www.youtube.com/watch?v=46WjUVqagTo&feature=youtu.be)







